lib/mcp/serializers/company_serializer.rb

      def self.serialize(company)
        {
          id: company.id,
          name: company.name,
          email: company.email,
          phone: company.phone,
          address: company.address,
          website: company.website,
          industry: company.industry,
          created_at: company.created_at&.iso8601,
          updated_at: company.updated_at&.iso8601,
          contacts_count: company.contacts.size,
          deals_count: company.deals.size
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."company_id" = 10
SELECT "deals".* FROM "deals" WHERE "deals"."company_id" = 10