app/controllers/companies_controller.rb

    def set_company
      @company = Company.find(params.expect(:id))
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = 5 LIMIT 1