app/controllers/deals_controller.rb

  def index
    @deals = Deal.all
---
SELECT "deals".* FROM "deals"

    def set_deal
      @deal = Deal.find(params.expect(:id))
---
SELECT "deals".* FROM "deals" WHERE "deals"."id" = 1 LIMIT 1