app/controllers/home_controller.rb

SELECT COUNT(*) FROM "companies"
SELECT COUNT(*) FROM "contacts"
SELECT COUNT(*) FROM "deals"
SELECT COUNT(*) FROM "activities"
SELECT "companies".* FROM "companies" ORDER BY "companies"."created_at" DESC LIMIT 5
SELECT "contacts".* FROM "contacts" ORDER BY "contacts"."created_at" DESC LIMIT 5
SELECT "deals".* FROM "deals" ORDER BY "deals"."created_at" DESC LIMIT 5
SELECT "activities".* FROM "activities" WHERE "activities"."status" = 'pending' ORDER BY "activities"."due_date" ASC LIMIT 10
SELECT SUM("deals"."amount") FROM "deals"
SELECT SUM("deals"."amount") FROM "deals" WHERE "deals"."stage" = 'closed_won'
---
  def dashboard
    @companies_count = Company.count
    @contacts_count = Contact.count
    @deals_count = Deal.count
    @activities_count = Activity.count

    @recent_companies = Company.order(created_at: :desc).limit(5)
    @recent_contacts = Contact.order(created_at: :desc).limit(5)
    @recent_deals = Deal.order(created_at: :desc).limit(5)
    @pending_activities = Activity.where(status: "pending").order(due_date: :asc).limit(10)

    @total_deal_value = Deal.sum(:amount)
    @won_deals_value = Deal.where(stage: "closed_won").sum(:amount)